added .env definitions
